In [3]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [4]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ·········

'Connected: root@bank'

**Use inner join to pull data from more than two tables in the same database**

 Demo how to extract all the information from three tables (`disp`, `client`, and `card`). Get all the columns from 3 tables (this is going to be useful later when we start using map, filter, etc.)

In [4]:
%%sql
select * from bank.disp d
join bank.client c on d.client_id = c.client_id
join bank.card ca on d.disp_id = ca.disp_id
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(9, 9, 7, 'OWNER', 9, 351016, 60, 1, 9, 'gold', '981016 00:00:00\r'),
 (19, 19, 14, 'OWNER', 19, 421228, 47, 2, 19, 'classic', '980313 00:00:00\r'),
 (41, 41, 33, 'OWNER', 41, 680827, 22, 3, 41, 'gold', '950903 00:00:00\r'),
 (42, 42, 34, 'OWNER', 42, 350817, 68, 4, 42, 'classic', '981126 00:00:00\r'),
 (51, 51, 43, 'OWNER', 51, 796202, 36, 5, 51, 'junior', '950424 00:00:00\r'),
 (56, 56, 48, 'OWNER', 56, 600331, 21, 7, 56, 'classic', '980611 00:00:00\r'),
 (60, 60, 51, 'OWNER', 60, 800219, 67, 8, 60, 'junior', '980520 00:00:00\r'),
 (76, 76, 65, 'OWNER', 76, 676001, 36, 9, 76, 'classic', '971025 00:00:00\r'),
 (77, 77, 66, 'OWNER', 77, 565218, 1, 10, 77, 'classic', '961207 00:00:00\r'),
 (79, 79, 68, 'OWNER', 79, 695310, 37, 11, 79, 'gold', '971025 00:00:00\r')]

In [5]:
%%sql
select d.disp_id, d.type, d.client_id, c.birth_number, ca.type from bank.disp d
join bank.client c on d.client_id = c.client_id
join bank.card ca on d.disp_id = ca.disp_id
where ca.type = 'gold'
limit 3;

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[(9, 'OWNER', 9, 351016, 'gold'),
 (41, 'OWNER', 41, 680827, 'gold'),
 (79, 'OWNER', 79, 695310, 'gold')]

 One more example - demo how to extract all the information from three tables (`disp`, `client`, and `district`):

In [6]:
%%sql
select * from bank.disp d
join bank.client c on d.client_id = c.client_id
join bank.district da on da.A1 = c.district_id
limit 3;

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[(1, 1, 1, 'OWNER', 1, 706213, 18, 18, 'Pisek', 'south Bohemia', 70699, 60, 13, 2, 1, 4, 65.3, 8968, 2.83, 3.35, 131, 1740, 1910),
 (2, 2, 2, 'OWNER', 2, 450204, 1, 1, 'Hl.m. Praha', 'Prague', 1204953, 0, 0, 0, 1, 1, 100.0, 12541, 0.29, 0.43, 167, 85677, 99107),
 (3, 3, 2, 'DISPONENT', 3, 406009, 1, 1, 'Hl.m. Praha', 'Prague', 1204953, 0, 0, 0, 1, 1, 100.0, 12541, 0.29, 0.43, 167, 85677, 99107)]

**Use outer joins to pull data from more than two tables in the same database.**

Outter left join

In [7]:
query_left = '''
select a.account_id, a.district_id, a.frequency, d.A2, d.A3, l.loan_id, l.amount, l.payments
from bank.account a 
left join bank.district d on a.district_id = d.A1
left join bank.loan l on a.account_id = l.account_id
order by a.account_id;
'''

In [8]:
df_left = %sql {query_left}
df_left = df_left.DataFrame()

 * mysql+pymysql://root:***@localhost/bank
4500 rows affected.

In [9]:
df_left

,account_id,district_id,frequency,A2,A3,loan_id,amount,payments
0,1,18,POPLATEK MESICNE,Pisek,south Bohemia,NaN,NaN,NaN
1,2,1,POPLATEK MESICNE,Hl.m. Praha,Prague,4959.0,80952.0,3373.0
2,3,5,POPLATEK MESICNE,Kolin,central Bohemia,NaN,NaN,NaN
3,4,12,POPLATEK MESICNE,Pribram,central Bohemia,NaN,NaN,NaN
4,5,15,POPLATEK MESICNE,Cesky Krumlov,south Bohemia,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...
4495,11333,8,POPLATEK MESICNE,Mlada Boleslav,central Bohemia,NaN,NaN,NaN
4496,11349,1,POPLATEK TYDNE,Hl.m. Praha,Prague,7304.0,419880.0,6998.0
4497,11359,61,POPLATEK MESICNE,Trebic,south Moravia,7305.0,54024.0,4502.0
4498,11362,67,POPLATEK MESICNE,Bruntal,north Moravia,7308.0,129408.0,5392.0
4499,11382,74,POPLATEK MESICNE,Ostrava - mesto,north Moravia,NaN,NaN,NaN

In [10]:
df_left.isna().sum()

account_id        0
district_id       0
frequency         0
A2                0
A3                0
loan_id        3818
amount         3818
payments       3818
dtype: int64

Inner join:

In [11]:
query_inner = '''
select a.account_id, a.district_id, a.frequency, d.A2, d.A3, l.loan_id, l.amount, l.payments
from bank.account a 
join bank.district d on a.district_id = d.A1
join bank.loan l on a.account_id = l.account_id
order by a.account_id;
'''

In [12]:
df_inner = %sql {query_inner}
df_inner = df_inner.DataFrame()

 * mysql+pymysql://root:***@localhost/bank
682 rows affected.

In [14]:
df_inner #quitamos los nans

,account_id,district_id,frequency,A2,A3,loan_id,amount,payments
0,2,1,POPLATEK MESICNE,Hl.m. Praha,Prague,4959,80952,3373.0
1,19,21,POPLATEK MESICNE,Tabor,south Bohemia,4961,30276,2523.0
2,25,68,POPLATEK MESICNE,Frydek - Mistek,north Moravia,4962,30276,2523.0
3,37,20,POPLATEK MESICNE,Strakonice,south Bohemia,4967,318480,5308.0
4,38,19,POPLATEK TYDNE,Prachatice,south Bohemia,4968,110736,2307.0
...,...,...,...,...,...,...,...,...
677,11327,7,POPLATEK MESICNE,Melnik,central Bohemia,7294,39168,1632.0
678,11328,54,POPLATEK MESICNE,Brno - mesto,south Moravia,7295,280440,4674.0
679,11349,1,POPLATEK TYDNE,Hl.m. Praha,Prague,7304,419880,6998.0
680,11359,61,POPLATEK MESICNE,Trebic,south Moravia,7305,54024,4502.0
681,11362,67,POPLATEK MESICNE,Bruntal,north Moravia,7308,129408,5392.0

In [15]:
df_inner.isna().sum()

account_id     0
district_id    0
frequency      0
A2             0
A3             0
loan_id        0
amount         0
payments       0
dtype: int64